Revit 2027 API
FabricationUtils.ValidateConnectivity Method
 Check if two connectors are valid to connect directly without couplings.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ValidateConnectivity(
	Document document,
	Connector connector1,
	Connector connector2
)
Public Shared Function ValidateConnectivity (
	document As Document,
	connector1 As Connector,
	connector2 As Connector
) As Boolean
public:
static bool ValidateConnectivity(
	Document^ document,
	Connector^ connector1,
	Connector^ connector2
)
static member ValidateConnectivity :
        document : Document *
        connector1 : Connector *
        connector2 : Connector -> bool
Parameters
document Document
 The document.
connector1 Connector
 First connector to check.
connector2 Connector
 Second connector to check against.
Return Value
Boolean
 True if connection is valid otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace